# FluidViscosity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..FluidViscosity Property
PipeFittingAndAccessoryData Class See Also
---
The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double FluidViscosity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FluidViscosity As Double
	Get
```

Visual C++
---
```text
public:
property double FluidViscosity {
	double get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace